Revit 2026 API

# LinePattern(String) Constructor

---

Creates a line pattern with given name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LinePattern(
	string name
)
```
```vb
Public Sub New (
	name As String
)
```
```cpp
public:
LinePattern(
	String^ name
)
```
```fsharp
new :
        name : string -> LinePattern
```

#### Parameters

name String
     The name.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

LinePattern Class

LinePattern Overload

Autodesk.Revit.DB Namespace